stress-tests/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
  environments:
    production:
      target: "https://your-production-url.com"
scenarios:
  - name: "Browse hackathons"
    flow:
      - get:
          url: "/"
      - think: 2
      - get:
          url: "/api/hackathons?page=1"
      - think: 1
      - get:
          url: "/hackathon/some-hackathon-slug"